
// 122 买卖股票的最佳时期



给你一个整数数组 prices ，其中 prices[i] 表示某支股票第 i 天的价格。
在每一天，你可以决定是否购买和/或出售股票。你在任何时候 最多 只能持有 一股 股票。你也可以先购买，然后在 同一天 出售。
返回 你能获得的 最大 利润 。

/**************/
示例 1：

输入：prices = [7,1,5,3,6,4]
输出：7
解释：在第 2 天（股票价格 = 1）的时候买入，在第 3 天（股票价格 = 5）的时候卖出, 这笔交易所能获得利润 = 5 - 1 = 4。
随后，在第 4 天（股票价格 = 3）的时候买入，在第 5 天（股票价格 = 6）的时候卖出, 这笔交易所能获得利润 = 6 - 3 = 3。
最大总利润为 4 + 3 = 7 。
示例 2：

输入：prices = [1,2,3,4,5]
输出：4
解释：在第 1 天（股票价格 = 1）的时候买入，在第 5 天 （股票价格 = 5）的时候卖出, 这笔交易所能获得利润 = 5 - 1 = 4。
最大总利润为 4 。

题解：
    本题目起始很简单，我们只需要理解一件事，当天卖出可以当天买入，因此所有的交易我们都可以局部化为前后两天的交易 并且不限制交易次数 意思是只要后一天股价比前一天高
我们就在这两天交易	如果后一天股价高 就继续买入 否则 不买入
class Solution {
public:
    int maxProfit(vector<int>& prices) {
        int totalProfit = 0;
        // 从第二天开始遍历，与前一天的价格进行比较
        for (int i = 1; i < prices.size(); ++i) {
            // 如果今天的价格比昨天的价格高，就进行一次交易
            // 并把利润加到总利润中
            if (prices[i] > prices[i - 1]) {
                totalProfit += prices[i] - prices[i - 1];
            }
        }
        return totalProfit;
    }
};